In [40]:
print(" Hello World") # Works normal like python

 Hello World

In [3]:
import pandas as pd # just to import the file

In [4]:
# 2 main datatypes
series = pd.Series(["BMW", "Toyota", "Honda"]) #pd.Series is like putting object in a list to call them out

In [5]:
series

0       BMW
1    Toyota
2     Honda
dtype: object

In [6]:
# series = 1-dimensional

In [7]:
# 2 main datatypes
colors = pd.Series(["Red", "Blue", "Yellow"]) #
colors

0       Red
1      Blue
2    Yellow
dtype: object

In [8]:
# dataframe = 2-dimensional
car_data = pd.DataFrame({"Car make": series, "Color": colors}) # calling out colors and series we listed earlier
car_data

  Car make   Color
0      BMW     Red
1   Toyota    Blue
2    Honda  Yellow

In [9]:
# Import data
car_sales = pd.read_csv("data/car-sales.csv") # pd.read_csv - this is to import the data we have in our folder note: folder location and file name must match
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [15]:
# Exporting data
car_sales.to_csv("data/exported-car-sales.csv", index=False) # this is to export the file and when we call index= false it removed some data we dont want

In [19]:
exported_car_sales = pd.read_csv("data/exported-car-sales.csv") # this is to import the file
exported_car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [20]:
# car_sales.mean(numeric_only=True) will work not  car_sales.mean()

## Describe data

In [22]:
# Attributes
car_sales.dtypes # attribute dont have () while function have it but depends on how you call them

# Function
#car_sales.to_csv()

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [23]:
car_sales.columns # .coloumns to list the data we have in columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [25]:
car_columns = car_sales.columns # just making it easier to call
car_columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [26]:
car_sales.index #

RangeIndex(start=0, stop=10, step=1)

In [27]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [28]:
car_sales.describe # .describe to describe the data we have

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [29]:
car_sales.info() # .info to get some specific information we need in the data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 532.0+ bytes

In [31]:
car_sales.mean(numeric_only=True) # to get the mean but you must put numeric_only = true because .mean does not work like before

Odometer (KM)    78601.4
Doors                4.0
dtype: float64

In [32]:
car_prices = pd.Series([300, 1500, 111250]) # just listing the data we have in series
car_prices.mean(numeric_only=True) # getting the mean of the data above

np.float64(37683.333333333336)

In [33]:
car_sales.sum() # .sum is the total sum thats is called out

Make             ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyo...
Colour               WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite
Odometer (KM)                                               786014
Doors                                                           40
Price            $4,000.00$5,000.00$7,000.00$22,000.00$3,500.00...
dtype: object

In [35]:
car_sales["Doors"].sum() # total sums of doors we have

np.int64(40)

In [37]:
len(car_sales) # len  is lenght of it but starts from 0 to 1

10

In [39]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

## Viewing and selecting data

In [42]:
car_sales.head(3) # gives the top part of the data

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
1   Honda    Red          87899      4  $5,000.00
2  Toyota   Blue          32549      3  $7,000.00

In [43]:
car_sales.tail(2) # gives the bottom part of the data

     Make Colour  Odometer (KM)  Doors      Price
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [47]:
# .loc and .iloc
animals = pd.Series(["cat", "dog", "bird", "panda", "snake"], index=[0, 3, 9, 8, 3])

In [48]:
animals

0      cat
3      dog
9     bird
8    panda
3    snake
dtype: object

In [51]:
# refrs to the index
animals.loc[9]

'bird'

In [53]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [54]:
car_sales.loc[0]

Make                Toyota
Colour               White
Odometer (KM)       150043
Doors                    4
Price            $4,000.00
Name: 0, dtype: object

In [55]:
# .iloc refers to the postion
animals.iloc[3]

'panda'

In [57]:
car_sales.iloc[1]

Make                 Honda
Colour                 Red
Odometer (KM)        87899
Doors                    4
Price            $5,000.00
Name: 1, dtype: object

In [58]:
animals.iloc[:3]

0     cat
3     dog
9    bird
dtype: object

In [59]:
car_sales.loc[:3] # same with .head

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00